UT_Marketplaces.Marketplaces/src/InformationRegisters/СтатусыРегистрацийТСД/СтатусыРегистрацийТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыРегистрацийТСД</name>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыРегистрацийТСД</types>
    </type>
  </resources>
  <resources>
    <name>ЛицензионныйКлючЛицензированиеТСД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/InformationRegisters/РегистрацияТСД/РегистрацияТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрацияТСД</name>
  <resources>
    <name>ВерсияМП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаПоследнегоОбращения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>IDТСД</name>
    <type>
      <types>CatalogRef.IDТСД</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

UT_Marketplaces.Marketplaces/src/Enums/СтатусыРегистрацийТСД/СтатусыРегистрацийТСД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыРегистрацийТСД</name>
  <enumValues>
    <name>ОтправленаНаРегистрацию</name>
  </enumValues>
  <enumValues>
    <name>ЛицензияПолучена</name>
  </enumValues>
  <enumValues>
    <name>ЛицензияЗаканчивается</name>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/CommonModules/ОбменДаннымиЛицензированиеТСД/Module.bsl
#Область ОбменСерверЛицензирования

// Возвращает структуру параметров для функции СоздатьWSПрокси.
//
// Возвращаемое значение:
//  Структура - коллекция параметров, см. СоздатьWSПрокси().
//
Функция ПараметрыПодключенияWSПрокси() 
	Результат = Новый Структура;
	Результат.Вставить("АдресWSDL");
	Результат.Вставить("URIПространстваИмен");
	Результат.Вставить("ИмяСервиса");
	Результат.Вставить("ИмяТочкиПодключения", "");
	Результат.Вставить("ИмяПользователя");
	Результат.Вставить("Пароль");
	Результат.Вставить("Таймаут", 0);
	Результат.Вставить("Местоположение");
	Результат.Вставить("ИспользоватьАутентификациюОС", Ложь);
	Результат.Вставить("ЗащищенноеСоединение", Неопределено);
	Возврат Результат;
КонецФункции

Функция АдресСервераЛицензирования()
	
	Возврат "https://rarus-dfis.corp.rarus-cloud.ru/TSD_Licence";

КонецФункции

Функция ПространствоИмен()

	Возврат "http://rarus.ru/TSDL/WS";	

КонецФункции

Функция ИмяСервиса() 

	Возврат "TSDDataExchange";

КонецФункции

Функция ПолучитьАдресWSDL(АдресСервера, ИмяСервиса)
	
	Возврат СтрШаблон("%1/ws/%2?wsdl", АдресСервера, ИмяСервиса);

КонецФункции

Функция СоздатьWSПрокси(ПереданныеПараметры) 
		
	ПараметрыПодключения = ПараметрыПодключенияWSПрокси();
	ЗаполнитьЗначенияСвойств(ПараметрыПодключения, ПереданныеПараметры);
		
	Возврат ВнутренняяWSПрокси(ПараметрыПодключения);
	
КонецФункции

Функция ВнутренняяWSПрокси(Параметры)
	
	АдресWSDL = Параметры.АдресWSDL;
	URIПространстваИмен = Параметры.URIПространстваИмен;
	ИмяСервиса = Параметры.ИмяСервиса;
	ИмяТочкиПодключения = Параметры.ИмяТочкиПодключения;
	ИмяПользователя = Параметры.ИмяПользователя;
	Пароль = Параметры.Пароль;
	Таймаут = Параметры.Таймаут;
	Местоположение = Параметры.Местоположение;
	ИспользоватьАутентификациюОС = Параметры.ИспользоватьАутентификациюОС;
	ЗащищенноеСоединение = Параметры.ЗащищенноеСоединение;
	
	Протокол = "";
	Позиция = СтрНайти(АдресWSDL, "://");
	Если Позиция > 0 Тогда
		Протокол = НРег(Лев(АдресWSDL, Позиция - 1));
	КонецЕсли;
		
	Если Протокол = "https" И ЗащищенноеСоединение = Неопределено Тогда
		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено);
	КонецЕсли;
	ИнтернетПрокси = Неопределено;
	
 	WSОпределения = Новый WSОпределения(АдресWSDL, ИмяПользователя, Пароль, ИнтернетПрокси, Таймаут, ЗащищенноеСоединение);
	Если ПустаяСтрока(ИмяТочкиПодключения) Тогда
		ИмяТочкиПодключения = ИмяСервиса + "Soap";
	КонецЕсли;
	
	
	
	Прокси = Новый WSПрокси(WSОпределения, URIПространстваИмен, ИмяСервиса, ИмяТочкиПодключения,
				ИнтернетПрокси, Таймаут, ЗащищенноеСоединение, Местоположение, ИспользоватьАутентификациюОС);
		
	Прокси.Пользователь = ИмяПользователя;
	Прокси.Пароль       = Пароль;
	
	Возврат Прокси; 
	
КонецФункции

Функция ПолучитьWSПроксиСервера(ИмяСервиса, ИмяПользователя, Пароль = "") 
	
	ПараметрыПрокси = ПолучитьПараметрыWSПрокси(ИмяСервиса, ИмяПользователя, Пароль);
	
	Возврат СоздатьWSПрокси(ПараметрыПрокси);
	
КонецФункции

Функция ПолучитьПараметрыWSПрокси(ИмяСервиса, ИмяПользователя, Пароль = "")

	ПараметрыПрокси = ПараметрыПодключенияWSПрокси();	
	ПараметрыПрокси.АдресWSDL = ПолучитьАдресWSDL(АдресСервераЛицензирования(), ИмяСервиса);	
	ПараметрыПрокси.URIПространстваИмен = ПространствоИмен();
	ПараметрыПрокси.ИмяСервиса = ИмяСервиса;
	ПараметрыПрокси.ИмяПользователя = ИмяПользователя;
	ПараметрыПрокси.Пароль = Пароль;
	
	Возврат ПараметрыПрокси;

КонецФункции

Функция ВыполнитьМетодСервераЛицензирования(ИмяМетода, Параметры = Неопределено)
	
	Параметры = ?(Параметры = Неопределено, Новый Структура, Параметры);
	Параметры.Вставить("Версия", Метаданные.Версия); 
	Параметры = СериализаторXDTO.ЗаписатьXDTO(Параметры);
	Прокси = ПолучитьWSПроксиСервера(ИмяСервиса(), "mobile");
	Результат = Вычислить("Прокси.ExecuteMethod(ИмяМетода, Параметры)");
	Возврат СериализаторXDTO.ПрочитатьXDTO(Результат); 
	
КонецФункции

Функция ОтправитьНаРегистрацию(РегДанные) Экспорт
			
	Возврат ВыполнитьМетодСервераЛицензирования("ЗарегистрироватьПолученныеДанные",РегДанные);
	
КонецФункции 

Функция ОтправитьНаПеререгистрацию(РегДанные) Экспорт
			
	Возврат ВыполнитьМетодСервераЛицензирования("ЗарегистрироватьПолученныеДанные",РегДанные);  

КонецФункции

Функция ПолучитьЛицензию(РегДанные) Экспорт
			
	Возврат ВыполнитьМетодСервераЛицензирования("ПолучитьЛицензионныйКлюч",РегДанные);
	
КонецФункции

#КонецОбласти


#Область ОбменТСД
Функция ВыполнитьМетодОбмена(ИмяФункции, Параметры = Неопределено) Экспорт
	Параметры = СериализаторXDTO.ПрочитатьXDTO(Параметры);
	Попытка
		Результат = Вычислить(СтрШаблон("%1(Параметры)", ИмяФункции));
		Если Результат = Неопределено Тогда
			Возврат СериализаторXDTO.ЗаписатьXDTO(Новый Структура("Успешно", Истина));
		ИначеЕсли ОбщегоНазначенияТСД.ЭтоЗначениеПримитивногоТипа(Результат) Тогда
			Возврат СериализаторXDTO.ЗаписатьXDTO(Новый Структура("Результат", Результат));
		Иначе//должна быть структура
			Возврат СериализаторXDTO.ЗаписатьXDTO(Результат);
		КонецЕсли;
	Исключение
		ПодробнаяОшибка = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ОпсаниеОшибки = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("Мобильное приложение", УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат СериализаторXDTO.ЗаписатьXDTO(Новый Структура("Успешно, Сообщение", Ложь, ОпсаниеОшибки));
	КонецПопытки;
КонецФункции            

Функция ПолучитьЛицензионныйКлюч(Параметры)
	
	Результат = Новый Структура("Успешно, Сообщение", Ложь, "Лицензионный ключ успешно получен");
	
	ЛицензионныеКлючи = ЗарегистрироватьТСДПолучитьЛК(Параметры);
	
	Если ЛицензионныеКлючи = Неопределено Или ЛицензионныеКлючи = "" Тогда
		Результат.Успешно = Ложь;
		Результат.Сообщение = "Лицензионного ключа нет";
	Иначе
		Результат.Успешно = Истина;
		Результат.Вставить("ЛицензионныеКлючи", ЛицензионныеКлючи);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Функция ЗарегистрироватьТСДПолучитьЛК(Данные)
	 
	ЛицензионныеКлючи = Неопределено;
	
	НайтиIDТСД = Справочники.IDТСД.НайтиПоНаименованию(Данные.IDТСД);
	
	Если НайтиIDТСД = Справочники.IDТСД.ПустаяСсылка() Тогда
		
		IDТСД = Справочники.IDТСД.СоздатьЭлемент();
		IDТСД.Наименование = Данные.IDТСД;
		IDТСД.ИдентификаторПодписчика = Данные.ИдентификаторПодписчика;
		IDТСД.Записать();
		
		ПредРегистрацияЛК(IDТСД.Ссылка,Данные.Версия);
		
	Иначе
		
		IDТСД = НайтиIDТСД.ПолучитьОбъект();
		IDТСД.ИдентификаторПодписчика = Данные.ИдентификаторПодписчика;
        IDТСД.Записать();
		
		ПредРегистрацияЛК(IDТСД.Ссылка,Данные.Версия);
		
		ЛицензионныеКлючи = ПолучитьЛКОрганизаций();	
		
	КонецЕсли;  
	
	Возврат ЛицензионныеКлючи;	          
	
КонецФункции 

Функция ПолучитьЛКОрганизаций()
	
	ЛицензионныеКлючи = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыРегистрацийТСД.Организация.Наименование КАК Организация,
	|	СтатусыРегистрацийТСД.ЛицензионныйКлючЛицензированиеТСД КАК ЛК
	|ИЗ
	|	РегистрСведений.СтатусыРегистрацийТСД КАК СтатусыРегистрацийТСД
	|ГДЕ
	|	СтатусыРегистрацийТСД.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыРегистрацийТСД.ОтправленаНаРегистрацию)";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЛицензионныеКлючи.Вставить(ВыборкаДетальныеЗаписи.Организация,ВыборкаДетальныеЗаписи.ЛК);	
	КонецЦикла;
		
	Возврат ЛицензионныеКлючи;
	
КонецФункции
                                                
Функция ПредРегистрацияЛК(IDТСД,ВерсияМП)
	
	НаборЗаписей = РегистрыСведений.РегистрацияТСД.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.IDТСД.Установить(IDТСД); 
	
	НоваяЗапись = НаборЗаписей.Добавить(); 
	
	НоваяЗапись.IDТСД = IDТСД; 
	НоваяЗапись.ВерсияМП = ВерсияМП; 
	НоваяЗапись.ДатаПоследнегоОбращения = ТекущаяДата();
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
	КонецПопытки;
	
КонецФункции	 

Функция ОтправитьУведомленияНаТСДСерверЛицензирования(Идентификаторы) Экспорт
			
	Результат = ВыполнитьМетодСервераЛицензирования("ОтправитьУведомленияНаТСД",Идентификаторы); 

КонецФункции
#КонецОбласти
